tool/maven.org
#+TITLE: Maven 包管理工具
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-08 Mon 11:04:00>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+TAGS: maven java mvn config


* Maven 工具简介
  [[http://maven.apache.org/][Maven]] 是一个非常优秀的 Java 项目中代码包管理工具。它默认将公共仓库放在
  *~/.m2/repository* 目录下面。有时候下载 Maven 是需要配置默认下载镜像到阿里云，
  这时候需要编辑 *~/.m2/settings.xml* 文件。

** 配置镜像源
  在国内访问官方 [[https://mvnrepository.com][Apache Maven Repository]] 的镜像站比较慢，添加下面的代码可以快速
  添加[[https://maven.aliyun.com][阿里云]]作为镜像源。
  #+BEGIN_SRC xml
    <mirror>
      <id>aliyun</id>
      <mirrorOf>*</mirrorOf>
      <name>ALiYun Public Repository</name>
      <url>https://maven.aliyun.com/nexus/content/groups/public</url>
    </mirror>
  #+END_SRC

* 使用 Maven
  Maven 官方给出了一个[[http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html][五分钟教程]]，里面有详细的介绍。其中我觉得一个比较重要的命令
  就是新建一个 maven 项目，这里先粘贴过来。

** 常用命令
   - ~mvn compile~ : 编译项目
   - ~mvn test~ : 运行测试
   - ~mvn package~ : 打包项目
   - ~mvn clean~ : 清除构建
   - ~mvn install~ : 安装文件本地代码仓库
   - ~mvn site~ : 生成项目的所有文档

** 如何创建项目
  #+BEGIN_SRC sh
    mvn archetype:generate -DinteractiveMode=false \
      -DgroupId=io.github.jeanhwea -DartifactId=mapp \
      -DarchetypeArtifactId=maven-archetype-quickstart
  #+END_SRC
  - ~-DinteractiveMode=false~ 设置不用交互
  - ~-DarchetypeArtifactId=...~ 设置骨架项目

** 安装 jar 文件到本机仓库
  使用 ~mvn install:install-file~ 可以快速安装 jar 包到本地仓库中

  #+BEGIN_SRC sh
    mvn install:install-file -Dpackaging=jar \
      -DgroupId=com.oracle -DartifactId=ojdbc6 -Dversion=11.2.0.4 \
      -Dfile=<path-to-jar>
  #+END_SRC

** 查看项目的所有依赖
   #+BEGIN_SRC sh
     # 树形显示所有依赖
     mvn dependency:tree
     # 列表显示所有依赖
     mvn dependency:list
   #+END_SRC

* 参考链接
  1. [[https://mvnrepository.com][Apache Maven Repository]]
