tool/maven.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-08 Mon 19:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Maven 包管理工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">Maven 包管理工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf71132d">1. Maven 工具简介</a>
<ul>
<li><a href="#orgedcbeac">1.1. 配置镜像源</a></li>
</ul>
</li>
<li><a href="#org68d2b93">2. 使用 Maven</a>
<ul>
<li><a href="#orgf9a4b99">2.1. 常用命令</a></li>
<li><a href="#orga69b9cf">2.2. 如何创建项目</a></li>
<li><a href="#org782e309">2.3. 安装 jar 文件到本机仓库</a></li>
<li><a href="#org81a9532">2.4. 查看项目的所有依赖</a></li>
</ul>
</li>
<li><a href="#orgdaab643">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf71132d" class="outline-2">
<h2 id="orgf71132d"><span class="section-number-2">1</span> Maven 工具简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://maven.apache.org/">Maven</a> 是一个非常优秀的 Java 项目中代码包管理工具。它默认将公共仓库放在
<b>~/.m2/repository</b> 目录下面。有时候下载 Maven 是需要配置默认下载镜像到阿里云，
这时候需要编辑 <b>~/.m2/settings.xml</b> 文件。
</p>
</div>

<div id="outline-container-orgedcbeac" class="outline-3">
<h3 id="orgedcbeac"><span class="section-number-3">1.1</span> 配置镜像源</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在国内访问官方 <a href="https://mvnrepository.com">Apache Maven Repository</a> 的镜像站比较慢，添加下面的代码可以快速
添加<a href="https://maven.aliyun.com">阿里云</a>作为镜像源。
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">mirror</span>&gt;
  &lt;<span style="color: #b58900;">id</span>&gt;aliyun&lt;/<span style="color: #b58900;">id</span>&gt;
  &lt;<span style="color: #b58900;">mirrorOf</span>&gt;*&lt;/<span style="color: #b58900;">mirrorOf</span>&gt;
  &lt;<span style="color: #b58900;">name</span>&gt;ALiYun Public Repository&lt;/<span style="color: #b58900;">name</span>&gt;
  &lt;<span style="color: #b58900;">url</span>&gt;https://maven.aliyun.com/nexus/content/groups/public&lt;/<span style="color: #b58900;">url</span>&gt;
&lt;/<span style="color: #b58900;">mirror</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org68d2b93" class="outline-2">
<h2 id="org68d2b93"><span class="section-number-2">2</span> 使用 Maven</h2>
<div class="outline-text-2" id="text-2">
<p>
Maven 官方给出了一个<a href="http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html">五分钟教程</a>，里面有详细的介绍。其中我觉得一个比较重要的命令
就是新建一个 maven 项目，这里先粘贴过来。
</p>
</div>

<div id="outline-container-orgf9a4b99" class="outline-3">
<h3 id="orgf9a4b99"><span class="section-number-3">2.1</span> 常用命令</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><code>mvn compile</code> : 编译项目</li>
<li><code>mvn test</code> : 运行测试</li>
<li><code>mvn package</code> : 打包项目</li>
<li><code>mvn clean</code> : 清除构建</li>
<li><code>mvn install</code> : 安装文件本地代码仓库</li>
<li><code>mvn site</code> : 生成项目的所有文档</li>
</ul>
</div>
</div>

<div id="outline-container-orga69b9cf" class="outline-3">
<h3 id="orga69b9cf"><span class="section-number-3">2.2</span> 如何创建项目</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">mvn archetype:generate -DinteractiveMode=false <span style="color: #2aa198;">\</span>
  -DgroupId=io.github.jeanhwea -DartifactId=mapp <span style="color: #2aa198;">\</span>
  -DarchetypeArtifactId=maven-archetype-quickstart
</pre>
</div>
<ul class="org-ul">
<li><code>-DinteractiveMode=false</code> 设置不用交互</li>
<li><code>-DarchetypeArtifactId=...</code> 设置骨架项目</li>
</ul>
</div>
</div>

<div id="outline-container-org782e309" class="outline-3">
<h3 id="org782e309"><span class="section-number-3">2.3</span> 安装 jar 文件到本机仓库</h3>
<div class="outline-text-3" id="text-2-3">
<p>
使用 <code>mvn install:install-file</code> 可以快速安装 jar 包到本地仓库中
</p>

<div class="org-src-container">
<pre class="src src-sh">mvn install:install-file -Dpackaging=jar <span style="color: #2aa198;">\</span>
  -DgroupId=com.oracle -DartifactId=ojdbc6 -Dversion=11.2.0.4 <span style="color: #2aa198;">\</span>
  -Dfile=&lt;path-to-jar&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org81a9532" class="outline-3">
<h3 id="org81a9532"><span class="section-number-3">2.4</span> 查看项目的所有依赖</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26641;&#24418;&#26174;&#31034;&#25152;&#26377;&#20381;&#36182;</span>
mvn dependency:tree
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21015;&#34920;&#26174;&#31034;&#25152;&#26377;&#20381;&#36182;</span>
mvn dependency:list
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdaab643" class="outline-2">
<h2 id="orgdaab643"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://mvnrepository.com">Apache Maven Repository</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-08 Mon 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-07-08 Mon 19:12</p>
<p class="validation"></p>
</div>
</body>
</html>
